using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace PDRTESTConsole
{
    internal class Program
    {
        static void Main(string[] args)
        {
            int errCount = 3;
            int errNow = 0;
            int[,] answ = {
                {0, 2},
                {1, 2},
                {2, 3},
                {3, 2},
                {4, 2},
                {5, 2},
                {6, 3},
                {7, 1},
                {8, 1},
                {9, 2},
            };
            string[,] qst = {
                {
                    "Як повинні вчинити водії в ситуації, коли пішохід, що виходить на проїзну частину, подає сигнал тростиною білого кольору, спрямованою вперед?",
                    "Подати звуковий сигнал, тому що в даному місці перехід дороги заборонено",
                    "Пропустити пішохода",
                    "Зменшити швидкість, і дотримуючись безпечного інтервалу, проїхати біля пішохода",
                    "Не звертати уваги на пішохода і їхати далі"
                },
                {
                    "Чи дозволяється самовільно відкривати шлагбаум на залізничному переїзді?",
                    "Дозволено, якщо вимкнена звукова та світлова сигналізація",
                    "Заборонено",
                    "Дозволено, щоб пропустити легковий автомобіль",
                    "Дозволено для пропуску пішоходів"
                },
                {
                    "Виїжджаючи з пішохідної зони, водій автомобіля повинен дати дорогу;",
                    "Пішоходам",
                    "Автомобілям",
                    "Пішоходам і автомобілям",
                    "Нікому"
                },
                {
                    "Чи дозволено зупинятися в тунелі для висадки чи посадки пасажирів?",
                    "Дозволено",
                    "Заборонено",
                    "Дозволено тільки в світлий час доби",
                    ""
                },
                {
                    "Чи дозволено Вам рух прямо, якщо перед вами знак Рух Заборонено?",
                    "Дозволено",
                    "Заборонено",
                    "Дозволено тільки в світлий час доби",
                    ""
                },
                {
                    "Чи дозволено Вам (водію не маршрутного ТЗ) здійснити висадку чи посадку пасажирів на зупинці для маршрутних ТЗ?",
                    "Дозволено",
                    "Заборонено",
                    "Дозволено, якщо Ви обслуговуєте підприємства,що там знаходяться",
                    ""
                },
                {
                    "Перевозити дітей у кузові вантажного автомобіля загальною масою до 3,5 т:",
                    "Дозволено",
                    "Заборонено",
                    "Дозволено у віці не молодше 16 років",
                    "Дозволено з 12 років"
                },
                {
                    "Чи порушує Правила велосипедист, рухаючись узбіччям дороги в темну пору доби без увімкненої фари або без світловідбивачів?",
                    "Порушує",
                    "Не порушує",
                    "",
                    ""
                },
                {
                    "Які з перелічених у відповідях дії повинен виконати водій транспортного засобу в разі наближення до нерегульованого пішохідного переходу, якщо на ньому перебувають пішоходи?",
                    "Зменшити швидкість, а за потреби зупинити автомобіль, щоб дати дорогу пішоходам",
                    "Проїхати без перешкод",
                    "Проїхати посигналивши пішоходам",
                    ""
                },
                {
                    "Передавати керування транспортним засобом особі, яка не має посвідчення а право керування ним, дозволено:",
                    "Якщо власник транспортного засобу перебуває в ньому",
                    "Якщо це стосується лише навчання водінню відповідно до вимог Правил",
                    "Якщо особа є найближчим родичем",
                    ""
                },
             };
            for (int i = 0; i < qst.GetLength(0); i++)
            {
                for (int j = 0; j < qst.GetLength(1); j++)
                {
                    if (j == 0)
                    {
                        Console.WriteLine("Питання: " + (i + 1).ToString());
                        Console.WriteLine(qst[i, j]);
                        Console.WriteLine();
                    }
                    else
                    {
                        if (qst[i, j] == "") continue;
                        Console.WriteLine(j.ToString() + ". " + qst[i, j]);
                    }

                }
                Console.WriteLine("Номер відповіді: ");
                int a = Int32.Parse(Console.ReadLine());
                if (answ[i, 1] == a)
                {
                    Console.WriteLine("Відповідь вірна!");
                    Console.WriteLine();
                }
                else
                {
                    errNow++;
                    if (errCount == errNow)
                    {
                        Console.WriteLine("Тест провалено!");
                        break;
                    }
                    Console.WriteLine("Помилкова відповідь " + errNow.ToString() + "/" + errCount.ToString());
                }
                if (i == (qst.GetLength(0) - 1))
                    Console.WriteLine("Ви успішно здали тест!");
            }
            Console.WriteLine("Enter to exit...");

        }
    }
}


